In [1]:
import numpy as np
import pandas as pd

In [3]:
# numpy are called arrays  ( more complex datastructures) - numbers in python
salaries = np.array([2000,4550,1000,3244])
print(salaries.shape)

(4,)

In [5]:
sal = np.array([[2390,1000,4300,900],[1234,9876,3245,800],[1000,2000,4000,5000]])
sal.shape

(3, 4)

In [8]:
sal.mean(axis =0)

array([1541.33333333, 4292.        , 3848.33333333, 2233.33333333])

In [11]:
# random numbers in numpy

num = np.random.randint(100,2000,(100,7))
num.std(axis =0)

array([553.65510663, 582.90600434, 525.44365597, 566.19282263,
       563.64240295, 547.07621727, 531.48788848])

# Pandas

In [16]:
# under tables -  work with pandas
table = pd.DataFrame()
table['name'] = ['john','paul','james','alice','alex']
table['Age'] = [23,10,34,56,90]
table['weight'] = [100,78,24,109,67]
table

    name  Age  weight
0   john   23     100
1   paul   10      78
2  james   34      24
3  alice   56     109
4   alex   90      67

In [17]:
# to extract one column
table['name']
# extract two or more columns
table[['Age','weight']]
# extract a row from the table
table.loc[0]

name      john
Age         23
weight     100
Name: 0, dtype: object

In [19]:
# to get specific data from the table you ise iloc
table.iloc[2,1]

34

In [22]:
# summaries of tables
# get the columns types
table.info()
# get a summary of the table
table.describe()
# shape of the data
table.shape

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   Age     5 non-null      int64
 2   weight  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

(5, 3)

In [25]:
table['calculated'] = table['weight']/table['Age']
table

    name  Age  weight  calculated
0   john   23     100    4.347826
1   paul   10      78    7.800000
2  james   34      24    0.705882
3  alice   56     109    1.946429
4   alex   90      67    0.744444

In [28]:
# each column behaves like a list
blank = []
for cal in table['calculated']:
    if cal <1.5:
        blank.append('low')
    else:
        blank.append('high')
table['claculated1'] = blank
# recreate the column based on list comprehension

    name  Age  weight  calculated claculated1
0   john   23     100    4.347826        high
1   paul   10      78    7.800000        high
2  james   34      24    0.705882         low
3  alice   56     109    1.946429        high
4   alex   90      67    0.744444         low

In [ ]:
# go through numpy 
# go through pandas